{
  "labels": [
    "O",
    "B-ACTION",
    "B-CAMERA_TYPE",
    "B-CONTACT_NAME",
    "B-DATE",
    "B-DEVICE",
    "B-FREQUENCY",
    "B-LEVEL",
    "B-LOCATION",
    "B-MESSAGE",
    "B-MODE",
    "B-PHONE",
    "B-PLATFORM",
    "B-QUERY",
    "B-RECEIVER",
    "B-REMINDER_CONTENT",
    "B-TIME",
    "I-ACTION",
    "I-CAMERA_TYPE",
    "I-CONTACT_NAME",
    "I-DATE",
    "I-DEVICE",
    "I-FREQUENCY",
    "I-LEVEL",
    "I-LOCATION",
    "I-MESSAGE",
    "I-MODE",
    "I-PHONE",
    "I-PLATFORM",
    "I-QUERY",
    "I-RECEIVER",
    "I-REMINDER_CONTENT",
    "I-TIME"
  ],
  "label_to_id": {
    "O": 0,
    "B-ACTION": 1,
    "B-CAMERA_TYPE": 2,
    "B-CONTACT_NAME": 3,
    "B-DATE": 4,
    "B-DEVICE": 5,
    "B-FREQUENCY": 6,
    "B-LEVEL": 7,
    "B-LOCATION": 8,
    "B-MESSAGE": 9,
    "B-MODE": 10,
    "B-PHONE": 11,
    "B-PLATFORM": 12,
    "B-QUERY": 13,
    "B-RECEIVER": 14,
    "B-REMINDER_CONTENT": 15,
    "B-TIME": 16,
    "I-ACTION": 17,
    "I-CAMERA_TYPE": 18,
    "I-CONTACT_NAME": 19,
    "I-DATE": 20,
    "I-DEVICE": 21,
    "I-FREQUENCY": 22,
    "I-LEVEL": 23,
    "I-LOCATION": 24,
    "I-MESSAGE": 25,
    "I-MODE": 26,
    "I-PHONE": 27,
    "I-PLATFORM": 28,
    "I-QUERY": 29,
    "I-RECEIVER": 30,
    "I-REMINDER_CONTENT": 31,
    "I-TIME": 32
  },
  "id_to_label": {
    "0": "O",
    "1": "B-ACTION",
    "2": "B-CAMERA_TYPE",
    "3": "B-CONTACT_NAME",
    "4": "B-DATE",
    "5": "B-DEVICE",
    "6": "B-FREQUENCY",
    "7": "B-LEVEL",
    "8": "B-LOCATION",
    "9": "B-MESSAGE",
    "10": "B-MODE",
    "11": "B-PHONE",
    "12": "B-PLATFORM",
    "13": "B-QUERY",
    "14": "B-RECEIVER",
    "15": "B-REMINDER_CONTENT",
    "16": "B-TIME",
    "17": "I-ACTION",
    "18": "I-CAMERA_TYPE",
    "19": "I-CONTACT_NAME",
    "20": "I-DATE",
    "21": "I-DEVICE",
    "22": "I-FREQUENCY",
    "23": "I-LEVEL",
    "24": "I-LOCATION",
    "25": "I-MESSAGE",
    "26": "I-MODE",
    "27": "I-PHONE",
    "28": "I-PLATFORM",
    "29": "I-QUERY",
    "30": "I-RECEIVER",
    "31": "I-REMINDER_CONTENT",
    "32": "I-TIME"
  },
  "num_labels": 33
}